tutorials/lagrangian/reactingParcelFoam/hotBoxes/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 300;
    }

    wallFilm
    {
        type            zeroGradient;
//        type            mapped;
//        field           Tsf;
//        average         300;
//        setAverage      no;
//        value           uniform 300;
    }
}


// ************************************************************************* //
